Revit 2026 API

# ElectricalSystemWays Property

---

The circuit ways used in the Electrical System.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int Ways { get; }
```
```vb
Public ReadOnly Property Ways As Integer
	Get
```
```cpp
public:
property int Ways {
	int get ();
}
```
```fsharp
member Ways : int with get
```

#### Property Value

Int32

This property is used to retrieve the ways of the Electrical System on a panel.

#### Reference

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace